{
	"name": "Aragorn Dai",
	"quotation": {
		"sentence": "Perfection is not attainable, but if we chase perfection we can catch excellence.",
		"from": "Vince Lombardi"
	},
	"info": [
		{
			"key": "age",
			"type": "function",
			"value": {
				"name": "getAge",
				"arguments": {
					"year": 1994,
					"month": 10,
					"day": 25
				}
			}
		},
		{
			"key": "gender",
			"type": "string",
			"value": "Male"
		},
		{
			"key": "home",
			"type": "string",
			"value": "Taipei, Taiwan"
		},
		{
			"key": "website",
			"type": "link",
			"value": {
				"reference": "https://aragorn1025.github.io/"
			}
		},
		{
			"key": "education",
			"type": "string",
			"value": "National Central University, Taiwan"
		},
		{
			"key": "major",
			"type": "string",
			"value": "Computer Science & Information Engineering"
		},
		{
			"key": "degree",
			"type": "string",
			"value": "Master"
		},
		{
			"key": "focus",
			"type": "array(string)",
			"value": [
				"Artificial Intelligence",
				"Deep Learning",
				"Machine Learning",
				"Image Processing",
				"Software Engineering"
			]
		}
	],
	"autobiography": [
		"Hello, I'm Aragorn. I graduated from National Central University, Taiwan. My major is Computer Science and Information Engineering, and I've got my master degree after graduation. I'm very interested in programming and have learned many kinds of programming languages, such as Java, Python, JavaScripts, Shell Scripts, etc. Thanks to the courses in my college, I have realized the importance of software engineering. As a consequence, I have studied hard in Object-oriented Programming, Version Control System, Virtualization, etc.",
		"After graduation, I had been a data scientist / software developer in a Taiwanese startup software company. My main responsibility was the backend development and maintenance. I implemented a micro-web-service architecture in Python which have been expanded to the most of the projects of the company. I also introduced the compiler and the encryption mechanism to the repository, for protecting the source codes from unauthorized cloning or black-hat hacking. Futhermore, I had been responsible for maintained a major product of the company, which is a cloud AI training / inferencing platform. In addition to debugging, I discussed the new user needs with the product manager, defined the API with the frontend developer, developed the new functions for meeting user needs, imporved the deployment procedures, managed the database, and monitored the hardware resources. Moreover, I had mentored about 15 interns on their special topics. Every week, I prepared course materials, hosted meetings and shared common concepts of software engineering with the college students. My work ability and programming skills was greatly imporved by cooperating with colleagues during this period.",
		"My hobby is bicycle and western pop music. In my leisure time, I'll put on my AirPods and go cycling in the riverside park. After enjoy pleasant breezes and brisk rhythm, I'll feel energetic. I'm someone who is easy-going and trustworthy. Apart from my own tasks, I also love to communicate and cooperate with the team. Therefore, I always remind myself to be friendly and modest to everyone. As a proverb goes \"If you want to go fast, go alone; if you want to go far, go together.\""
	]
}